Revit 2025 API
gbXMLBuildingOperatingSchedule Enumeration
 Enumerations for gbXML (Green Building XML) format, used for energy analysis, schema version 0.34.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum gbXMLBuildingOperatingSchedule
Public Enumeration gbXMLBuildingOperatingSchedule
public enum class gbXMLBuildingOperatingSchedule
type gbXMLBuildingOperatingSchedule
Members
Member name | Value | Description
DefaultOperatingSchedule | 0
TwentyFourHourSevenDayFacility | 1
TwentyFourHourHourSixDayFacility | 2
TwentyFourHourHourFiveDayFacility | 3
TwelveHourSevenDayFacility | 4
TwelveHourSixDayFacility | 5
TwelveHourFiveDayFacility | 6
KindergartenThruTwelveGradeSchool | 7
YearRoundSchool | 8
TheaterPerformingArts | 9
Worship | 10
NoOfOperatingScheduleEnums | 11
Remarks
 This enumeration corresponds to the buildingType attribute in gbXML and is used to specify the building operating schedule.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace